In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

### Importing data

In [3]:
data = pd.read_csv ('../data/raw/adult.data')
data.head()

,Unnamed: 0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

## Checking Columns, Range, Values, and Shape

In [4]:
data.columns

Index(['Unnamed: 0', '39', ' State-gov', ' 77516', ' Bachelors', ' 13',
       ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male',
       ' 2174', ' 0', ' 40', ' United-States', ' <=50K'],
      dtype='object')

In [5]:
data.index

RangeIndex(start=0, stop=32560, step=1)

In [6]:
data.values

array([[0, 50, ' Self-emp-not-inc', ..., 13, ' United-States', ' <=50K'],
       [1, 38, ' Private', ..., 40, ' United-States', ' <=50K'],
       [2, 53, ' Private', ..., 40, ' United-States', ' <=50K'],
       ...,
       [32557, 58, ' Private', ..., 40, ' United-States', ' <=50K'],
       [32558, 22, ' Private', ..., 20, ' United-States', ' <=50K'],
       [32559, 52, ' Self-emp-inc', ..., 40, ' United-States', ' >50K']],
      dtype=object)

In [7]:
data.shape

(32560, 16)

## Dropping and renaming columns

In [8]:
#droping columns
df_clean1 = data.drop([' State-gov', '39', ' 77516', ' 13', ' 2174', ' 0', ' 40', 'Unnamed: 0', ' Never-married', ' Adm-clerical', ' Not-in-family'], axis=1)
df_clean1.head(-5)

           Bachelors                White     Male   United-States   <=50K
0          Bachelors                White     Male   United-States   <=50K
1            HS-grad                White     Male   United-States   <=50K
2               11th                Black     Male   United-States   <=50K
3          Bachelors                Black   Female            Cuba   <=50K
4            Masters                White   Female   United-States   <=50K
...              ...                  ...      ...             ...     ...
32550           10th   Amer-Indian-Eskimo     Male   United-States   <=50K
32551      Assoc-voc                White     Male   United-States   <=50K
32552        Masters   Asian-Pac-Islander     Male          Taiwan   <=50K
32553        Masters                White     Male   United-States    >50K
32554   Some-college                White     Male   United-States   <=50K

[32555 rows x 5 columns]

In [9]:
#renaming columns
df_c2 = df_clean1.rename({' State-gov': 'Work Class',' <=50K':'Income', ' White':'Race', ' Adm-clerical': 'Occupation', ' Bachelors': 'Education Level', 
                          ' Never-married': 'Marital-Status', ' Male': 'Sex', ' Not-in-family': 'Relationship', ' United-States': 'Native-Country'}, axis=1)
df_c2.head()

  Education Level    Race      Sex  Native-Country  Income
0       Bachelors   White     Male   United-States   <=50K
1         HS-grad   White     Male   United-States   <=50K
2            11th   Black     Male   United-States   <=50K
3       Bachelors   Black   Female            Cuba   <=50K
4         Masters   White   Female   United-States   <=50K

# Checking for NaN's

In [13]:
#checking for NaN's: no missing values
#df_c2.isnull()
#Checking for NaN's in individual rows
#for i in range(len(df_c2.index)) :
#     print(" Total NaN in row", i + 1, ":",
#           df_c2.iloc[i].isnull().sum())

print(" \nCount total NaN in a DataFrame : \n\n",
       df_c2.isnull().sum().sum())

Count total NaN in a DataFrame :

 0